app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 5]]
---
<h1><%= @user.name  %></h1>
<% @user.recipes.each do |recipe| %>