app/views/ingredients/show.html.erb

<h1><%= @ingredient.name %></h1>
<% @ingredient.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]